RT-Thread/rt-thread/bsp/hc32/libraries/hc32f4a0_ddl/drivers/hc32_ll_driver/src/hc32_ll_tmr2.c
/**
 *******************************************************************************
 * @file  hc32_ll_tmr2.c
 * @brief This file provides firmware functions to manage the TMR2(Timer2).
 @verbatim
   Change Logs:
   Date             Author          Notes
   2022-03-31       CDT             First version
 @endverbatim
 *******************************************************************************
 * Copyright (C) 2022, Xiaohua Semiconductor Co., Ltd. All rights reserved.
 *
 * This software component is licensed by XHSC under BSD 3-Clause license
 * (the "License"); You may not use this file except in compliance with the
 * License. You may obtain a copy of the License at:
 *                    opensource.org/licenses/BSD-3-Clause
 *
 *******************************************************************************
 */

/*******************************************************************************
 * Include files
 ******************************************************************************/
#include "hc32_ll_tmr2.h"
#include "hc32_ll_utility.h"

/**
 * @addtogroup LL_Driver
 * @{
 */

/**
 * @defgroup LL_TMR2 TMR2
 * @brief TMR2 Driver Library
 * @{
 */
#if (LL_TMR2_ENABLE == DDL_ON)

/*******************************************************************************
 * Local type definitions ('typedef')
 ******************************************************************************/

/*******************************************************************************
 * Local pre-processor symbols/macros ('#define')
 ******************************************************************************/
/**
 * @defgroup TMR2_Local_Macros TMR2 Local Macros
 * @{
 */

/**
 * @defgroup TMR2_Configuration_Bit_Mask TMR2 Configuration Bit Mask
 * @{
 */
#define TMR2_BCONR_INIT_MASK                (TMR2_BCONR_CAPMDA | TMR2_BCONR_SYNSA | TMR2_BCONR_SYNCLKA | \
                                             TMR2_BCONR_ASYNCLKA | TMR2_BCONR_CKDIVA | TMR2_BCONR_SYNCLKAT)
#define TMR2_BCONR_CLK_CFG_MASK             (TMR2_BCONR_SYNSA | TMR2_BCONR_SYNCLKA | \
                                             TMR2_BCONR_ASYNCLKA | TMR2_BCONR_SYNCLKAT)

#define TMR2_PWM_POLARITY_MASK              (TMR2_PCONR_STACA | TMR2_PCONR_STPCA | TMR2_PCONR_CMPCA)
#define TMR2_FILTER_CLK_DIV_MASK            (TMR2_PCONR_NOFICKA)
/**
 * @}
 */

/**
 * @defgroup TMR2_Channel_Cfg_Bit_Field_Offset TMR2 Channel Configuration Bit Field Offset
 * @{
 */
#define TMR2_CH_OFFSET                      (16U)

#define TMR2_PWM_POLARITY_OFFSET            (2U)

/**
 * @}
 */

/**
 * @defgroup TMR2_Check_Parameters_Validity TMR2 check parameters validity
 * @{
 */
#define IS_TMR2_BIT_MASK(x, mask)   (((x) != 0U) && (((x) | (mask)) == (mask)))

/* Unit and channel */
#define IS_TMR2_UNIT(x)                                                        \
(   ((x) == CM_TMR2_1)                       ||                                \
    ((x) == CM_TMR2_2)                       ||                                \
    ((x) == CM_TMR2_3)                       ||                                \
    ((x) == CM_TMR2_4))

#define IS_TMR2_CH(x)               ((x) <= TMR2_CH_B)

#define IS_TMR2_FUNC(x)             (((x) == TMR2_FUNC_CMP) || ((x) == TMR2_FUNC_CAPT))

/* Clock source */
#define IS_TMR2_CLK_SRC(x)                                                     \
(   ((x) == TMR2_CLK_PCLK1)                 ||                                 \
    ((x) == TMR2_CLK_TRIG_RISING)           ||                                 \
    ((x) == TMR2_CLK_TRIG_FALLING)          ||                                 \
    ((x) == TMR2_CLK_EVT)                   ||                                 \
    ((x) == TMR2_CLK_TMR6_OVF)              ||                                 \
    ((x) == TMR2_CLK_TMR6_UDF)              ||                                 \
    ((x) == TMR2_CLK_TMR6_OVF_UDF)          ||                                 \
    ((x) == TMR2_CLK_LRC)                   ||                                 \
    ((x) == TMR2_CLK_XTAL32)                ||                                 \
    ((x) == TMR2_CLK_PIN_CLK))

#define IS_TMR2_CLK_DIV(x)                                                     \
(   ((x) == TMR2_CLK_DIV1)                  ||                                 \
    ((x) == TMR2_CLK_DIV2)                  ||                                 \
    ((x) == TMR2_CLK_DIV4)                  ||                                 \
    ((x) == TMR2_CLK_DIV8)                  ||                                 \
    ((x) == TMR2_CLK_DIV16)                 ||                                 \
    ((x) == TMR2_CLK_DIV32)                 ||                                 \
    ((x) == TMR2_CLK_DIV64)                 ||                                 \
    ((x) == TMR2_CLK_DIV128)                ||                                 \
    ((x) == TMR2_CLK_DIV256)                ||                                 \
    ((x) == TMR2_CLK_DIV512)                ||                                 \
    ((x) == TMR2_CLK_DIV1024))

#define IS_TMR2_INT(x)              IS_TMR2_BIT_MASK((x), TMR2_INT_ALL)

#define IS_TMR2_FLAG(x)             IS_TMR2_BIT_MASK((x), TMR2_FLAG_ALL)

#define IS_TMR2_PWM_START_POLARITY(x)                                          \
(   ((x) == TMR2_PWM_LOW)                   ||                                 \
    ((x) == TMR2_PWM_HIGH)                  ||                                 \
    ((x) == TMR2_PWM_HOLD))

#define IS_TMR2_PWM_STOP_POLARITY(x)                                           \
(   ((x) == TMR2_PWM_LOW)                   ||                                 \
    ((x) == TMR2_PWM_HIGH)                  ||                                 \
    ((x) == TMR2_PWM_HOLD))

#define IS_TMR2_PWM_MATCH_CMP_POLARITY(x)                                      \
(   ((x) == TMR2_PWM_LOW)                   ||                                 \
    ((x) == TMR2_PWM_HIGH)                  ||                                 \
    ((x) == TMR2_PWM_HOLD)                  ||                                 \
    ((x) == TMR2_PWM_INVT))

#define IS_TMR2_PWM_POLARITY(st, pol)                                          \
(   (((st) == TMR2_CNT_STAT_START) && IS_TMR2_PWM_START_POLARITY(pol))      || \
    (((st) == TMR2_CNT_STAT_STOP) && IS_TMR2_PWM_STOP_POLARITY(pol))        || \
    (((st) == TMR2_CNT_STAT_MATCH_CMP) && IS_TMR2_PWM_MATCH_CMP_POLARITY(pol)))

#define IS_TMR2_START_COND(x)       IS_TMR2_BIT_MASK((x), TMR2_START_COND_ALL)

#define IS_TMR2_STOP_COND(x)        IS_TMR2_BIT_MASK((x), TMR2_STOP_COND_ALL)

