RT-Thread/rt-thread/bsp/hc32/libraries/hc32f4a0_ddl/drivers/hc32_ll_driver/src/hc32_ll_tmr2.c
#define IS_TMR2_CLR_COND(x)         IS_TMR2_BIT_MASK((x), TMR2_CLR_COND_ALL)

#define IS_TMR2_CAPT_COND(x)        IS_TMR2_BIT_MASK((x), TMR2_CAPT_COND_ALL)

#define IS_TMR2_FILTER_CLK_DIV(x)                                              \
(   ((x) == TMR2_FILTER_CLK_DIV1)           ||                                 \
    ((x) == TMR2_FILTER_CLK_DIV4)           ||                                 \
    ((x) == TMR2_FILTER_CLK_DIV16)          ||                                 \
    ((x) == TMR2_FILTER_CLK_DIV64))

#define IS_TMR2_VALID_VAL(x)        ((x) <= 0xFFFFUL)

/**
 * @}
 */

/**
 * @}
 */

/*******************************************************************************
 * Global variable definitions (declared in header file with 'extern')
 ******************************************************************************/

/*******************************************************************************
 * Local function prototypes ('static')
 ******************************************************************************/

/*******************************************************************************
 * Local variable definitions ('static')
 ******************************************************************************/

/*******************************************************************************
 * Function implementation - global ('extern') and local ('static')
 ******************************************************************************/
/**
 * @defgroup TMR2_Global_Functions TMR2 Global Functions
 * @{
 */

/**
 * @brief  Initializes the specified TMR2 channel according to the specified parameters
 *         in the structure stc_tmr2_init_t
 * @param  [in]  TMR2x                  Pointer to TMR2 instance register base.
 *                                      This parameter can be a value of the following:
 *   @arg  CM_TMR2_x or CM_TMR2
 * @param  [in]  u32Ch                  TMR2 channel.
 *                                      This parameter can be a value of @ref TMR2_Channel
 * @param  [in]  pstcTmr2Init           Pointer to a stc_tmr2_init_t structure value that
 *                                      contains the configuration information for the TMR2 channel.
 * @retval int32_t:
 *           - LL_OK:                   No error occurred.
 *           - LL_ERR_INVD_PARAM:       pstcTmr2Init == NULL.
 */
int32_t TMR2_Init(CM_TMR2_TypeDef *TMR2x, uint32_t u32Ch, const stc_tmr2_init_t *pstcTmr2Init)
{
    uint32_t u32Tmp;
    int32_t i32Ret = LL_ERR_INVD_PARAM;
    __IO uint32_t *reg32CMPR;

    DDL_ASSERT(IS_TMR2_UNIT(TMR2x));
    DDL_ASSERT(IS_TMR2_CH(u32Ch));

    if (pstcTmr2Init != NULL) {
        DDL_ASSERT(IS_TMR2_CLK_SRC(pstcTmr2Init->u32ClockSrc));
        DDL_ASSERT(IS_TMR2_CLK_DIV(pstcTmr2Init->u32ClockDiv));
        DDL_ASSERT(IS_TMR2_FUNC(pstcTmr2Init->u32Func));
        DDL_ASSERT(IS_TMR2_VALID_VAL(pstcTmr2Init->u32CompareValue));

        u32Tmp = pstcTmr2Init->u32Func | pstcTmr2Init->u32ClockSrc |
                 pstcTmr2Init->u32ClockDiv;
        reg32CMPR = (__IO uint32_t *)((uint32_t)&TMR2x->CMPAR);
        WRITE_REG32(reg32CMPR[u32Ch], pstcTmr2Init->u32CompareValue);
        /* Channel bit filed offset. */
        u32Ch *= TMR2_CH_OFFSET;
        MODIFY_REG32(TMR2x->BCONR, (TMR2_BCONR_INIT_MASK << u32Ch), (u32Tmp << u32Ch));
        i32Ret = LL_OK;
    }

    return i32Ret;
}

/**
 * @brief  Set a default value for TMR2 initialization structure.
 * @param  [in]  pstcTmr2Init           Pointer to a stc_tmr2_init_t structure that
 *                                      contains configuration information.
 * @retval int32_t:
 *           - LL_OK:                   No errors occurred.
 *           - LL_ERR_INVD_PARAM:       pstcTmr2Init == NULL.
 */
int32_t TMR2_StructInit(stc_tmr2_init_t *pstcTmr2Init)
{
    int32_t i32Ret = LL_ERR_INVD_PARAM;

    if (pstcTmr2Init != NULL) {
        pstcTmr2Init->u32ClockSrc = TMR2_CLK_PCLK1;
        pstcTmr2Init->u32ClockDiv = TMR2_CLK_DIV1;
        pstcTmr2Init->u32Func     = TMR2_FUNC_CMP;
        pstcTmr2Init->u32CompareValue = 0xFFFFUL;
        i32Ret = LL_OK;
    }

    return i32Ret;
}

/**
 * @brief  De-initializes the specified TMR2 unit.
 * @param  [in]  TMR2x                  Pointer to TMR2 instance register base.
 *                                      This parameter can be a value of the following:
 *   @arg  CM_TMR2_x or CM_TMR2
 * @retval None
 */
void TMR2_DeInit(CM_TMR2_TypeDef *TMR2x)
{
    DDL_ASSERT(IS_TMR2_UNIT(TMR2x));

    TMR2_Stop(TMR2x, TMR2_CH_A);
    TMR2_Stop(TMR2x, TMR2_CH_B);
    WRITE_REG32(TMR2x->CMPBR, 0xFFFFU);
    CLR_REG32(TMR2x->CNTBR);
    CLR_REG32(TMR2x->CNTAR);
    CLR_REG32(TMR2x->BCONR);
    CLR_REG32(TMR2x->ICONR);
    CLR_REG32(TMR2x->PCONR);
    CLR_REG32(TMR2x->HCONR);
    CLR_REG32(TMR2x->STFLR);
    WRITE_REG32(TMR2x->CMPAR, 0xFFFFU);
}

/**
 * @brief  Specifies the function mode for the specified TMR2 channel.
 * @param  [in]  TMR2x                  Pointer to TMR2 instance register base.
 *                                      This parameter can be a value of the following:
 *   @arg  CM_TMR2_x or CM_TMR2
 * @param  [in]  u32Ch                  TMR2 channel.
 *                                      This parameter can be a value of @ref TMR2_Channel
 * @param  [in]  u32Func                Function mode.
 *                                      This parameter can be a value of @ref TMR2_Function
 *   @arg  TMR2_FUNC_CMP:               The function of TMR2 channel is ouput compare.
 *   @arg  TMR2_FUNC_CAPT:              The function of TMR2 channel is input capture.
 * @retval None
 */
void TMR2_SetFunc(CM_TMR2_TypeDef *TMR2x, uint32_t u32Ch, uint32_t u32Func)
{
    DDL_ASSERT(IS_TMR2_UNIT(TMR2x));
    DDL_ASSERT(IS_TMR2_CH(u32Ch));
    DDL_ASSERT(IS_TMR2_FUNC(u32Func));

    /* Channel bit filed offset. */
    u32Ch *= TMR2_CH_OFFSET;
    MODIFY_REG32(TMR2x->BCONR, (TMR2_BCONR_CAPMDA << u32Ch), (u32Func << u32Ch));
}

/**
 * @brief  Specifies the clock source for the specified TMR2 channel.
 * @param  [in]  TMR2x                  Pointer to TMR2 instance register base.
 *                                      This parameter can be a value of the following:
 *   @arg  CM_TMR2_x or CM_TMR2
 * @param  [in]  u32Ch                  TMR2 channel.
 *                                      This parameter can be a value of @ref TMR2_Channel
 * @param  [in]  u32Src                 Clock source.
 *                                      This parameter can be a value of @ref TMR2_Clock_Source
 * @retval None
 */
void TMR2_SetClockSrc(CM_TMR2_TypeDef *TMR2x, uint32_t u32Ch, uint32_t u32Src)
{
    DDL_ASSERT(IS_TMR2_UNIT(TMR2x));
    DDL_ASSERT(IS_TMR2_CH(u32Ch));
    DDL_ASSERT(IS_TMR2_CLK_SRC(u32Src));

