RT-Thread/rt-thread/bsp/hc32/libraries/hc32f4a0_ddl/drivers/hc32_ll_driver/src/hc32_ll_tmr2.c
    /* Channel bit filed offset. */
    u32Ch *= TMR2_CH_OFFSET;
    MODIFY_REG32(TMR2x->BCONR, (TMR2_BCONR_CLK_CFG_MASK << u32Ch), (u32Src << u32Ch));
}

/**
 * @brief  Specifies the clock divider for the specified TMR2 channel.
 * @param  [in]  TMR2x                  Pointer to TMR2 instance register base.
 *                                      This parameter can be a value of the following:
 *   @arg  CM_TMR2_x or CM_TMR2
 * @param  [in]  u32Ch                  TMR2 channel.
 *                                      This parameter can be a value of @ref TMR2_Channel
 * @param  [in]  u32Div                 Clock divider.
 *                                      This parameter can be a value of @ref TMR2_Clock_Divider
 * @retval None
 */
void TMR2_SetClockDiv(CM_TMR2_TypeDef *TMR2x, uint32_t u32Ch, uint32_t u32Div)
{
    DDL_ASSERT(IS_TMR2_UNIT(TMR2x));
    DDL_ASSERT(IS_TMR2_CH(u32Ch));
    DDL_ASSERT(IS_TMR2_CLK_DIV(u32Div));

    /* Channel bit filed offset. */
    u32Ch *= TMR2_CH_OFFSET;
    MODIFY_REG32(TMR2x->BCONR, (TMR2_BCONR_CKDIVA << u32Ch), (u32Div << u32Ch));
}

/**
 * @brief  Set a default value for the TMR2 output compare configuration structure.
 * @param  [in]  pstPwmInit             Pointer to a stc_tmr2_pwm_init_t structure value that
 *                                      contains the configuration information for the TMR2 PWM.
 * @retval int32_t:
 *           - LL_OK:                   No error occurred.
 *           - LL_ERR_INVD_PARAM:       pstcTmr2Init == NULL.
 */
int32_t TMR2_PWM_StructInit(stc_tmr2_pwm_init_t *pstPwmInit)
{
    int32_t i32Ret = LL_ERR_INVD_PARAM;

    if (pstPwmInit != NULL) {
        pstPwmInit->u32StartPolarity = TMR2_PWM_HIGH;
        pstPwmInit->u32StopPolarity  = TMR2_PWM_LOW;
        pstPwmInit->u32CompareMatchPolarity = TMR2_PWM_INVT;
        i32Ret = LL_OK;
    }

    return i32Ret;
}

/**
 * @brief  Configures the PWM of the specified TMR2 channel
 *         according to the specified parameters in the structure @ref stc_tmr2_pwm_init_t
 * @param  [in]  TMR2x                  Pointer to TMR2 instance register base.
 *                                      This parameter can be a value of the following:
 *   @arg  CM_TMR2_x or CM_TMR2
 * @param  [in]  u32Ch                  TMR2 channel.
 *                                      This parameter can be a value of @ref TMR2_Channel
 * @param  [in]  pstPwmInit             Pointer to a @ref stc_tmr2_pwm_init_t structure value that
 *                                      contains the configuration information for the TMR2 PWM.
 * @retval int32_t:
 *           - LL_OK:                   No error occurred.
 *           - LL_ERR_INVD_PARAM:       pstcTmr2Init == NULL.
 */
int32_t TMR2_PWM_Init(CM_TMR2_TypeDef *TMR2x, uint32_t u32Ch, const stc_tmr2_pwm_init_t *pstPwmInit)
{
    uint32_t u32Tmp;
    int32_t i32Ret = LL_ERR_INVD_PARAM;

    DDL_ASSERT(IS_TMR2_UNIT(TMR2x));
    DDL_ASSERT(IS_TMR2_CH(u32Ch));

    if (pstPwmInit != NULL) {
        DDL_ASSERT(IS_TMR2_PWM_START_POLARITY(pstPwmInit->u32StartPolarity));
        DDL_ASSERT(IS_TMR2_PWM_STOP_POLARITY(pstPwmInit->u32StopPolarity));
        DDL_ASSERT(IS_TMR2_PWM_MATCH_CMP_POLARITY(pstPwmInit->u32CompareMatchPolarity));
        /* Configures PWM polarity. */
        u32Tmp = (pstPwmInit->u32StartPolarity << TMR2_PCONR_STACA_POS) | \
                 (pstPwmInit->u32StopPolarity << TMR2_PCONR_STPCA_POS)  | \
                 (pstPwmInit->u32CompareMatchPolarity << TMR2_PCONR_CMPCA_POS);
        u32Ch *= TMR2_CH_OFFSET;
        MODIFY_REG32(TMR2x->PCONR, (TMR2_PWM_POLARITY_MASK << u32Ch), (u32Tmp << u32Ch));
        i32Ret = LL_OK;
    }

    return i32Ret;
}

/**
 * @brief  Enable or disable PWM output of the specified TMR2 channel.
 * @param  [in]  TMR2x                  Pointer to TMR2 instance register base.
 *                                      This parameter can be a value of the following:
 *   @arg  CM_TMR2_x or CM_TMR2
 * @param  [in]  u32Ch                  TMR2 channel.
 *                                      This parameter can be a value of @ref TMR2_Channel
 * @param  [in]  enNewState             An @ref en_functional_state_t enumeration value.
 * @retval None
 */
void TMR2_PWM_OutputCmd(CM_TMR2_TypeDef *TMR2x, uint32_t u32Ch, en_functional_state_t enNewState)
{
    uint32_t u32PCONRAddr;
    uint8_t au8EnPos[] = {TMR2_PCONR_OUTENA_POS, TMR2_PCONR_OUTENB_POS};
    DDL_ASSERT(IS_TMR2_UNIT(TMR2x));
    DDL_ASSERT(IS_TMR2_CH(u32Ch));
    DDL_ASSERT(IS_FUNCTIONAL_STATE(enNewState));

    u32PCONRAddr = (uint32_t)&TMR2x->PCONR;
    WRITE_REG32(PERIPH_BIT_BAND(u32PCONRAddr, au8EnPos[u32Ch]), enNewState);
}

/**
 * @brief  Enable or disable the specified hardware capture condition.
 * @param  [in]  TMR2x                  Pointer to TMR2 instance register base.
 *                                      This parameter can be a value of the following:
 *   @arg  CM_TMR2_x or CM_TMR2
 * @param  [in]  u32Ch                  TMR2 channel.
 *                                      This parameter can be a value of @ref TMR2_Channel
 * @param  [in]  u32Cond                Hardware capture condition.
 *                                      This parameter can be a value of @ref TMR2_Capture_Condition
 * @param  [in]  enNewState             An @ref en_functional_state_t enumeration value.
 * @retval None
 */
void TMR2_HWCaptureCondCmd(CM_TMR2_TypeDef *TMR2x, uint32_t u32Ch, uint32_t u32Cond, en_functional_state_t enNewState)
{
    DDL_ASSERT(IS_TMR2_UNIT(TMR2x));
    DDL_ASSERT(IS_TMR2_CH(u32Ch));
    DDL_ASSERT(IS_TMR2_CAPT_COND(u32Cond));
    DDL_ASSERT(IS_FUNCTIONAL_STATE(enNewState));

    u32Cond <<= (u32Ch * TMR2_CH_OFFSET);

    if (enNewState == ENABLE) {
        SET_REG32_BIT(TMR2x->HCONR, u32Cond);
    } else {
        CLR_REG32_BIT(TMR2x->HCONR, u32Cond);
    }
}

/**
 * @brief  Enable or disable the specified hardware start condition.
 * @param  [in]  TMR2x                  Pointer to TMR2 instance register base.
 *                                      This parameter can be a value of the following:
 *   @arg  CM_TMR2_x or CM_TMR2
 * @param  [in]  u32Ch                  TMR2 channel.
 *                                      This parameter can be a value of @ref TMR2_Channel
 * @param  [in]  u32Cond                Hardware start condition.
 *                                      This parameter can be a value of @ref TMR2_Start_Condition
 * @param  [in]  enNewState             An @ref en_functional_state_t enumeration value.
 * @retval None
 */
void TMR2_HWStartCondCmd(CM_TMR2_TypeDef *TMR2x, uint32_t u32Ch, uint32_t u32Cond, en_functional_state_t enNewState)
{
    DDL_ASSERT(IS_TMR2_UNIT(TMR2x));
    DDL_ASSERT(IS_TMR2_CH(u32Ch));
    DDL_ASSERT(IS_TMR2_START_COND(u32Cond));
    DDL_ASSERT(IS_FUNCTIONAL_STATE(enNewState));

    u32Cond <<= (u32Ch * TMR2_CH_OFFSET);

    if (enNewState == ENABLE) {
        SET_REG32_BIT(TMR2x->HCONR, u32Cond);
    } else {
        CLR_REG32_BIT(TMR2x->HCONR, u32Cond);
    }
}

/**
 * @brief  Enable or disable the specified hardware stop condition.
 * @param  [in]  TMR2x                  Pointer to TMR2 instance register base.
 *                                      This parameter can be a value of the following:
 *   @arg  CM_TMR2_x or CM_TMR2
 * @param  [in]  u32Ch                  TMR2 channel.
 *                                      This parameter can be a value of @ref TMR2_Channel
 * @param  [in]  u32Cond                Hardware stop condition.
 *                                      This parameter can be a value of @ref TMR2_Stop_Condition
 * @param  [in]  enNewState             An @ref en_functional_state_t enumeration value.
 * @retval None
 */
void TMR2_HWStopCondCmd(CM_TMR2_TypeDef *TMR2x, uint32_t u32Ch, uint32_t u32Cond, en_functional_state_t enNewState)
{
    DDL_ASSERT(IS_TMR2_UNIT(TMR2x));
    DDL_ASSERT(IS_TMR2_CH(u32Ch));
    DDL_ASSERT(IS_TMR2_STOP_COND(u32Cond));
    DDL_ASSERT(IS_FUNCTIONAL_STATE(enNewState));

    u32Cond <<= (u32Ch * TMR2_CH_OFFSET);

    if (enNewState == ENABLE) {
        SET_REG32_BIT(TMR2x->HCONR, u32Cond);
    } else {
        CLR_REG32_BIT(TMR2x->HCONR, u32Cond);
    }
}

/**
 * @brief  Enable or disable the specified hardware clear condition.
 * @param  [in]  TMR2x                  Pointer to TMR2 instance register base.
 *                                      This parameter can be a value of the following:
 *   @arg  CM_TMR2_x or CM_TMR2
 * @param  [in]  u32Ch                  TMR2 channel.
 *                                      This parameter can be a value of @ref TMR2_Channel
 * @param  [in]  u32Cond                Hardware clear condition.
 *                                      This parameter can be a value of @ref TMR2_Clear_Condition
 * @param  [in]  enNewState             An @ref en_functional_state_t enumeration value.
 * @retval None
 */
void TMR2_HWClearCondCmd(CM_TMR2_TypeDef *TMR2x, uint32_t u32Ch, uint32_t u32Cond, en_functional_state_t enNewState)
{
    DDL_ASSERT(IS_TMR2_UNIT(TMR2x));
    DDL_ASSERT(IS_TMR2_CH(u32Ch));
    DDL_ASSERT(IS_TMR2_CLR_COND(u32Cond));
    DDL_ASSERT(IS_FUNCTIONAL_STATE(enNewState));

    u32Cond <<= (u32Ch * TMR2_CH_OFFSET);

    if (enNewState == ENABLE) {
        SET_REG32_BIT(TMR2x->HCONR, u32Cond);
    } else {
        CLR_REG32_BIT(TMR2x->HCONR, u32Cond);
    }
}

/**
 * @brief  Specifies the clock divider of filter.
 * @param  [in]  TMR2x                  Pointer to TMR2 instance register base.
 *                                      This parameter can be a value of the following:
 *   @arg  CM_TMR2_x or CM_TMR2
 * @param  [in]  u32Ch                  TMR2 channel.
 *                                      This parameter can be a value of @ref TMR2_Channel
 * @param  [in]  u32Div                 The clock source divider of the filter.
 *                                      This parameter can be a value of @ref TMR2_Filter_Clock_Divider
 *   @arg  TMR2_FILTER_CLK_DIV1:        The filter clock is the clock of timer2 / 1.
 *   @arg  TMR2_FILTER_CLK_DIV4:        The filter clock is the clock of timer2 / 4.
 *   @arg  TMR2_FILTER_CLK_DIV16:       The filter clock is the clock of timer2 / 16.
 *   @arg  TMR2_FILTER_CLK_DIV64:       The filter clock is the clock of timer2 / 64.
 * @retval None
 */
void TMR2_SetFilterClockDiv(CM_TMR2_TypeDef *TMR2x, uint32_t u32Ch, uint32_t u32Div)
{
    DDL_ASSERT(IS_TMR2_UNIT(TMR2x));
    DDL_ASSERT(IS_TMR2_CH(u32Ch));
    DDL_ASSERT(IS_TMR2_FILTER_CLK_DIV(u32Div));

    u32Ch *= TMR2_CH_OFFSET;
    MODIFY_REG32(TMR2x->PCONR, TMR2_FILTER_CLK_DIV_MASK << u32Ch, u32Div << u32Ch);
}

/**
 * @brief  Enable or disable the filter of the specified TMR2 channel.
 * @param  [in]  TMR2x                  Pointer to TMR2 instance register base.
 *                                      This parameter can be a value of the following:
 *   @arg  CM_TMR2_x or CM_TMR2
 * @param  [in]  u32Ch                  TMR2 channel.
 *                                      This parameter can be a value of @ref TMR2_Channel
 * @param  [in]  enNewState             An @ref en_functional_state_t enumeration value.
 * @retval None
 */
void TMR2_FilterCmd(CM_TMR2_TypeDef *TMR2x, uint32_t u32Ch, en_functional_state_t enNewState)
{
    uint32_t u32PCONRAddr;
    uint8_t au8EnPos[] = {TMR2_PCONR_NOFIENA_POS, TMR2_PCONR_NOFIENB_POS};
    DDL_ASSERT(IS_TMR2_UNIT(TMR2x));
    DDL_ASSERT(IS_TMR2_CH(u32Ch));
    DDL_ASSERT(IS_FUNCTIONAL_STATE(enNewState));

    u32PCONRAddr = (uint32_t)&TMR2x->PCONR;
    WRITE_REG32(PERIPH_BIT_BAND(u32PCONRAddr, au8EnPos[u32Ch]), enNewState);
}

/**
 * @brief  Enable or disable the interrupt of the specified TMR2 channel.
 * @param  [in]  TMR2x                  Pointer to TMR2 instance register base.
 *                                      This parameter can be a value of the following:
 *   @arg  CM_TMR2_x or CM_TMR2
 * @param  [in]  u32IntType             The interrupt type.
 *                                      This parameter can be values of @ref TMR2_Interrupt_Type
 * @param  [in]  enNewState             An @ref en_functional_state_t enumeration value.
 * @retval None
 */
void TMR2_IntCmd(CM_TMR2_TypeDef *TMR2x, uint32_t u32IntType, en_functional_state_t enNewState)
{
    DDL_ASSERT(IS_TMR2_UNIT(TMR2x));
    DDL_ASSERT(IS_TMR2_INT(u32IntType));
    DDL_ASSERT(IS_FUNCTIONAL_STATE(enNewState));

    if (enNewState == ENABLE) {
        SET_REG32_BIT(TMR2x->ICONR, u32IntType);
    } else {
        CLR_REG32_BIT(TMR2x->ICONR, u32IntType);
    }
}

/**
 * @brief  Start the specified TMR2 channel.
 * @param  [in]  TMR2x                  Pointer to TMR2 instance register base.
 *                                      This parameter can be a value of the following:
 *   @arg  CM_TMR2_x or CM_TMR2
 * @param  [in]  u32Ch                  TMR2 channel.
 *                                      This parameter can be a value of @ref TMR2_Channel
 * @retval None
 */
void TMR2_Start(CM_TMR2_TypeDef *TMR2x, uint32_t u32Ch)
{
    DDL_ASSERT(IS_TMR2_UNIT(TMR2x));
    DDL_ASSERT(IS_TMR2_CH(u32Ch));

    SET_REG32_BIT(TMR2x->BCONR, TMR2_BCONR_CSTA << (u32Ch * TMR2_CH_OFFSET));
}

/**
 * @brief  Stop the specified TMR2 channel.
 * @param  [in]  TMR2x                  Pointer to TMR2 instance register base.
 *                                      This parameter can be a value of the following:
 *   @arg  CM_TMR2_x or CM_TMR2
 * @param  [in]  u32Ch                  TMR2 channel.
 *                                      This parameter can be a value of @ref TMR2_Channel
 * @retval None
 */
void TMR2_Stop(CM_TMR2_TypeDef *TMR2x, uint32_t u32Ch)
{
    DDL_ASSERT(IS_TMR2_UNIT(TMR2x));
    DDL_ASSERT(IS_TMR2_CH(u32Ch));

    CLR_REG32_BIT(TMR2x->BCONR, TMR2_BCONR_CSTA << (u32Ch * TMR2_CH_OFFSET));
}

/**
 * @brief  Get the status of the specified TMR2 flag.
 * @param  [in]  TMR2x                  Pointer to TMR2 instance register base.
 *                                      This parameter can be a value of the following:
 *   @arg  CM_TMR2_x or CM_TMR2
 * @param  [in]  u32Flag                TMR2 status flag.
 *                                      This parameter can be values of @ref TMR2_Status_Flag
 * @retval An @ref en_flag_status_t enumeration type value.
 */
en_flag_status_t TMR2_GetStatus(const CM_TMR2_TypeDef *TMR2x, uint32_t u32Flag)
{
    en_flag_status_t enStatus = RESET;

    DDL_ASSERT(IS_TMR2_UNIT(TMR2x));
    DDL_ASSERT(IS_TMR2_FLAG(u32Flag));

    if (READ_REG32_BIT(TMR2x->STFLR, u32Flag) != 0U) {
        enStatus = SET;
    }

