RT-Thread/rt-thread/bsp/hc32/libraries/hc32f4a0_ddl/drivers/hc32_ll_driver/src/hc32_ll_tmr2.c
    return enStatus;
}

/**
 * @brief  Clear the status of the specified TMR2 flag.
 * @param  [in]  TMR2x                  Pointer to TMR2 instance register base.
 *                                      This parameter can be a value of the following:
 *   @arg  CM_TMR2_x or CM_TMR2
 * @param  [in]  u32Flag                TMR2 status flag.
 *                                      This parameter can be values of @ref TMR2_Status_Flag
 * @retval None
 */
void TMR2_ClearStatus(CM_TMR2_TypeDef *TMR2x, uint32_t u32Flag)
{
    DDL_ASSERT(IS_TMR2_UNIT(TMR2x));
    DDL_ASSERT(IS_TMR2_FLAG(u32Flag));
    CLR_REG32_BIT(TMR2x->STFLR, u32Flag);
}

/**
 * @brief  Set compare value for the specified TMR2 channel.
 * @param  [in]  TMR2x                  Pointer to TMR2 instance register base.
 *                                      This parameter can be a value of the following:
 *   @arg  CM_TMR2_x or CM_TMR2
 * @param  [in]  u32Ch                  The TMR2 channel.
 *                                      This parameter can be a value of @ref TMR2_Channel
 * @param  [in]  u32Value               The compare reference value of the specified TMR2 channel.
 *                                      This parameter can be a number between 0U and 0xFFFFU, inclusive.
 * @retval None
 */
void TMR2_SetCompareValue(CM_TMR2_TypeDef *TMR2x, uint32_t u32Ch, uint32_t u32Value)
{
    __IO uint32_t *reg32CMPR;

    DDL_ASSERT(IS_TMR2_UNIT(TMR2x));
    DDL_ASSERT(IS_TMR2_VALID_VAL(u32Value));

    reg32CMPR = (__IO uint32_t *)((uint32_t)&TMR2x->CMPAR);
    WRITE_REG32(reg32CMPR[u32Ch], u32Value);
}

/**
 * @brief  Get compare value of the specified TMR2 channel.
 * @param  [in]  TMR2x                  Pointer to TMR2 instance register base.
 *                                      This parameter can be a value of the following:
 *   @arg  CM_TMR2_x or CM_TMR2
 * @param  [in]  u32Ch                The TMR2 channel.
 *                                      This parameter can be a value of @ref TMR2_Channel
 * @retval The compare value of the specified TMR2 channel. A number between 0U and 0xFFFFU, inclusive.
 */
uint32_t TMR2_GetCompareValue(const CM_TMR2_TypeDef *TMR2x, uint32_t u32Ch)
{
    __IO uint32_t *reg32CMPR;

    DDL_ASSERT(IS_TMR2_UNIT(TMR2x));
    DDL_ASSERT(IS_TMR2_CH(u32Ch));

    reg32CMPR = (__IO uint32_t *)((uint32_t)&TMR2x->CMPAR);
    return reg32CMPR[u32Ch];
}

/**
 * @brief  Set counter value for the specified TMR2 channel.
 * @param  [in]  TMR2x                  Pointer to TMR2 instance register base.
 *                                      This parameter can be a value of the following:
 *   @arg  CM_TMR2_x or CM_TMR2
 * @param  [in]  u32Ch                  The TMR2 channel.
 *                                      This parameter can be a value of @ref TMR2_Channel
 * @param  [in]  u32Value               The counter value for the specified TMR2 channel.
 *                                      This parameter can be a number between 0U and 0xFFFFU, inclusive.
 * @retval None
 */
void TMR2_SetCountValue(CM_TMR2_TypeDef *TMR2x, uint32_t u32Ch, uint32_t u32Value)
{
    __IO uint32_t *reg32CNTR;

    DDL_ASSERT(IS_TMR2_UNIT(TMR2x));
    DDL_ASSERT(IS_TMR2_CH(u32Ch));
    DDL_ASSERT(IS_TMR2_VALID_VAL(u32Value));

    reg32CNTR = (__IO uint32_t *)((uint32_t)&TMR2x->CNTAR);
    WRITE_REG32(reg32CNTR[u32Ch], u32Value);
}

/**
 * @brief  Get counter value of the specified TMR2 channel.
 * @param  [in]  TMR2x                  Pointer to TMR2 instance register base.
 *                                      This parameter can be a value of the following:
 *   @arg  CM_TMR2_x or CM_TMR2
 * @param  [in]  u32Ch                  The TMR2 channel.
 *                                      This parameter can be a value of @ref TMR2_Channel
 * @retval The counter value of the specified TMR2 channel. A number between 0U and 0xFFFFU, inclusive.
 */
uint32_t TMR2_GetCountValue(const CM_TMR2_TypeDef *TMR2x, uint32_t u32Ch)
{
    __IO uint32_t *reg32CNTR;

    DDL_ASSERT(IS_TMR2_UNIT(TMR2x));
    DDL_ASSERT(IS_TMR2_CH(u32Ch));

    reg32CNTR = (__IO uint32_t *)((uint32_t)&TMR2x->CNTAR);
    return reg32CNTR[u32Ch];
}

/**
 * @brief  Specifies the ouput polarity of the PWM at the specified state of counter.
 * @param  [in]  TMR2x                  Pointer to TMR2 instance register base.
 *                                      This parameter can be a value of the following:
 *   @arg  CM_TMR2_x or CM_TMR2
 * @param  [in]  u32Ch                  TMR2 channel.
 *                                      This parameter can be a value @ref TMR2_Channel
 * @param  [in]  u8CountState           TMR2 counter state.
 *                                      This parameter can be a value @ref TMR2_Counter_State
 * @param  [in]  u32Polarity            The polarity of PWM.
 *                                      This parameter can be a value @ref TMR2_PWM_Polarity
 * @retval None
 */
void TMR2_PWM_SetPolarity(CM_TMR2_TypeDef *TMR2x, uint32_t u32Ch, uint8_t u8CountState, uint32_t u32Polarity)
{
    uint32_t u32PolarityPos;

    DDL_ASSERT(IS_TMR2_UNIT(TMR2x));
    DDL_ASSERT(IS_TMR2_CH(u32Ch));
    DDL_ASSERT(IS_TMR2_PWM_POLARITY(u8CountState, u32Polarity));

    u32PolarityPos = ((uint32_t)u8CountState * TMR2_PWM_POLARITY_OFFSET) + (u32Ch * TMR2_CH_OFFSET);
    MODIFY_REG32(TMR2x->PCONR, TMR2_PCONR_STACA << u32PolarityPos, u32Polarity << u32PolarityPos);
}

/**
 * @}
 */

#endif /* LL_TMR2_ENABLE */

/**
 * @}
 */

/**
* @}
*/

/******************************************************************************
 * EOF (not truncated)
 *****************************************************************************/
